### Forest: Mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.mainnet.data.digitalocean_project.forest_project: Reading...
module.mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=d76ce0bc-2196-11ee-9a05-0a58ac14d046]
module.mainnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.mainnet.digitalocean_droplet.forest: Refreshing state... [id=365814162]
module.mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=365814162-d76ce0bc-2196-11ee-9a05-0a58ac14d046-20230718141638066900000001]
module.mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=ccd5e181-32b0-4bd2-8146-ad5e895d8e88]
module.mainnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.mainnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-07-18T14:15:15Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "365814162" -> (known after apply)
      ~ ipv4_address         = "104.248.129.36" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:365814162" -> (known after apply)
      ~ user_data            = "e382e806b8ac23e0fb2fae6ee5915b59a4a0dee9" -> "a78336abd16ad75c645227f605cd493ca8f0c150" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [
          - "d76ce0bc-2196-11ee-9a05-0a58ac14d046",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 365814162,
        ] -> (known after apply)
        id              = "ccd5e181-32b0-4bd2-8146-ad5e895d8e88"
        name            = "forest-mainnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:365814162",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.mainnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 365814162 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "365814162-d76ce0bc-2196-11ee-9a05-0a58ac14d046-20230718141638066900000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>